## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.event.published"] will be created
+   resource "datadog_metric_metadata" "custom" {
+       description = "Count of events published to EventBridge."
+       id          = (known after apply)
+       metric      = "grants_ingest.PublishGrantEvents.event.published"
+       short_name  = "Published events"
+       unit        = "message"
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.grant_data.invalid"] will be created
+   resource "datadog_metric_metadata" "custom" {
+       description = "Count of grants mapped from a DynamoDB item image that failed target schema validation."
+       id          = (known after apply)
+       metric      = "grants_ingest.PublishGrantEvents.grant_data.invalid"
+       short_name  = "Invalid mapper results"
+       unit        = "document"
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.invocation_batch_size"] will be created
+   resource "datadog_metric_metadata" "custom" {
+       description = "Count of records contained in the stream batch for an invocation."
+       id          = (known after apply)
+       metric      = "grants_ingest.PublishGrantEvents.invocation_batch_size"
+       short_name  = "Invocation batch size"
+       unit        = "record"
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.item_image.build"] will be created
+   resource "datadog_metric_metadata" "custom" {
+       description = "Count of attempts to build a data document mapped from a DynamoDB item image."
+       id          = (known after apply)
+       metric      = "grants_ingest.PublishGrantEvents.item_image.build"
+       short_name  = "Item image build attempts"
+       unit        = "attempt"
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.item_image.malformatted_field"] will be created
+   resource "datadog_metric_metadata" "custom" {
+       description = "Count of DynamoDB item image attributes found to be incompatible with the target schema."
+       id          = (known after apply)
+       metric      = "grants_ingest.PublishGrantEvents.item_image.malformatted_field"
+       short_name  = "Malformatted item image fields"
+       unit        = "occurrence"
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.record.failed"] will be created
+   resource "datadog_metric_metadata" "custom" {
+       description = "Count of records in the stream invocation batch that did not result in a published event."
+       id          = (known after apply)
+       metric      = "grants_ingest.PublishGrantEvents.record.failed"
+       short_name  = "Failed invocation batch records"
+       unit        = "record"
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.aws_sqs_queue.dlq will be created
+   resource "aws_sqs_queue" "dlq" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 262144
+       message_retention_seconds         = 1209600
+       name                              = "publish_grant_events_dlq"
+       name_prefix                       = (known after apply)
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 20
+       redrive_allow_policy              = (known after apply)
+       redrive_policy                    = (known after apply)
+       sqs_managed_sse_enabled           = true
+       tags_all                          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 3600
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-06-30T21:47:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:12/invocations" -> (known after apply)
      ~ s3_key                         = "builds/4d9229ca40e9ee86b4685097d2599e12b595b89703a2293689d642e923b53193.zip" -> "builds/190e98fa83fffe7a3c8aa651e545e2630573d5021a978467deac94fb469e505c.zip"
      ~ s3_object_version              = "qdOx8JjtTIk77b2mgeVIhgRnBkZZ0zIn" -> (known after apply)
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:168a2d7e85c8abf06f1b3970cc403377b869c8b6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "168a2d7e85c8abf06f1b3970cc403377b869c8b6"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "12" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1998ebc08a79d6ebe5213d96b613f018-2" -> (known after apply)
      ~ id                     = "builds/4d9229ca40e9ee86b4685097d2599e12b595b89703a2293689d642e923b53193.zip" -> (known after apply)
      ~ key                    = "builds/4d9229ca40e9ee86b4685097d2599e12b595b89703a2293689d642e923b53193.zip" -> "builds/190e98fa83fffe7a3c8aa651e545e2630573d5021a978467deac94fb469e505c.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/4d9229ca40e9ee86b4685097d2599e12b595b89703a2293689d642e923b53193.zip" -> "builds/190e98fa83fffe7a3c8aa651e545e2630573d5021a978467deac94fb469e505c.zip"
-       tags                   = {} -> null
      ~ version_id             = "qdOx8JjtTIk77b2mgeVIhgRnBkZZ0zIn" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/190e98fa83fffe7a3c8aa651e545e2630573d5021a978467deac94fb469e505c.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/190e98fa83fffe7a3c8aa651e545e2630573d5021a978467deac94fb469e505c.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7295082756956721199" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/4d9229ca40e9ee86b4685097d2599e12b595b89703a2293689d642e923b53193.zip" -> "builds/190e98fa83fffe7a3c8aa651e545e2630573d5021a978467deac94fb469e505c.zip"
          ~ "timestamp" = "1688161614604058000" -> "1689207402188855000"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1861815578349962383" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/4d9229ca40e9ee86b4685097d2599e12b595b89703a2293689d642e923b53193.zip" -> "builds/190e98fa83fffe7a3c8aa651e545e2630573d5021a978467deac94fb469e505c.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-06-30T21:47:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:37/invocations" -> (known after apply)
      ~ s3_key                         = "builds/42fb910a803369e626f2727acdb0773014e465e5b0ba77a51263c8946b701de5.zip" -> "builds/8e76b19254c1bbd627e14a4a08165bbfc65fa14d40bb69e2d7c99bb48629a65b.zip"
      ~ s3_object_version              = "YjEjYfLRd2akg2KniJa5KpO1AUDZsnEr" -> (known after apply)
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:168a2d7e85c8abf06f1b3970cc403377b869c8b6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "168a2d7e85c8abf06f1b3970cc403377b869c8b6"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d3e5fe9bfd6144f96ef7b9e8bcba9aab-2" -> (known after apply)
      ~ id                     = "builds/42fb910a803369e626f2727acdb0773014e465e5b0ba77a51263c8946b701de5.zip" -> (known after apply)
      ~ key                    = "builds/42fb910a803369e626f2727acdb0773014e465e5b0ba77a51263c8946b701de5.zip" -> "builds/8e76b19254c1bbd627e14a4a08165bbfc65fa14d40bb69e2d7c99bb48629a65b.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/42fb910a803369e626f2727acdb0773014e465e5b0ba77a51263c8946b701de5.zip" -> "builds/8e76b19254c1bbd627e14a4a08165bbfc65fa14d40bb69e2d7c99bb48629a65b.zip"
-       tags                   = {} -> null
      ~ version_id             = "YjEjYfLRd2akg2KniJa5KpO1AUDZsnEr" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/8e76b19254c1bbd627e14a4a08165bbfc65fa14d40bb69e2d7c99bb48629a65b.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/8e76b19254c1bbd627e14a4a08165bbfc65fa14d40bb69e2d7c99bb48629a65b.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5394636694715610358" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/42fb910a803369e626f2727acdb0773014e465e5b0ba77a51263c8946b701de5.zip" -> "builds/8e76b19254c1bbd627e14a4a08165bbfc65fa14d40bb69e2d7c99bb48629a65b.zip"
          ~ "timestamp" = "1688161597007071000" -> "1689207383969242000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1795306918265251547" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/42fb910a803369e626f2727acdb0773014e465e5b0ba77a51263c8946b701de5.zip" -> "builds/8e76b19254c1bbd627e14a4a08165bbfc65fa14d40bb69e2d7c99bb48629a65b.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-06-30T21:47:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:17/invocations" -> (known after apply)
      ~ s3_key                         = "builds/db7940afe72c98644c1af0e578d61ccf4b964442fb0aae704ef95b4f77a80ab3.zip" -> "builds/84b5af99a6b0bb797abe8e562d90b4c223381c57a98fd5fe5a0c05affd849dbd.zip"
      ~ s3_object_version              = "QS38Cs66XSoLSTyxYCw47p_o.A4KTdfA" -> (known after apply)
        tags                           = {}
      ~ version                        = "17" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:168a2d7e85c8abf06f1b3970cc403377b869c8b6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "168a2d7e85c8abf06f1b3970cc403377b869c8b6"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "17" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "dec1336ef9c38ea8df6b7cc374fc98d2-2" -> (known after apply)
      ~ id                     = "builds/db7940afe72c98644c1af0e578d61ccf4b964442fb0aae704ef95b4f77a80ab3.zip" -> (known after apply)
      ~ key                    = "builds/db7940afe72c98644c1af0e578d61ccf4b964442fb0aae704ef95b4f77a80ab3.zip" -> "builds/84b5af99a6b0bb797abe8e562d90b4c223381c57a98fd5fe5a0c05affd849dbd.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/db7940afe72c98644c1af0e578d61ccf4b964442fb0aae704ef95b4f77a80ab3.zip" -> "builds/84b5af99a6b0bb797abe8e562d90b4c223381c57a98fd5fe5a0c05affd849dbd.zip"
-       tags                   = {} -> null
      ~ version_id             = "QS38Cs66XSoLSTyxYCw47p_o.A4KTdfA" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/84b5af99a6b0bb797abe8e562d90b4c223381c57a98fd5fe5a0c05affd849dbd.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/84b5af99a6b0bb797abe8e562d90b4c223381c57a98fd5fe5a0c05affd849dbd.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6086997738311947235" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/db7940afe72c98644c1af0e578d61ccf4b964442fb0aae704ef95b4f77a80ab3.zip" -> "builds/84b5af99a6b0bb797abe8e562d90b4c223381c57a98fd5fe5a0c05affd849dbd.zip"
          ~ "timestamp" = "1688161614908956000" -> "1689207402399966000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8841688867235743131" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/db7940afe72c98644c1af0e578d61ccf4b964442fb0aae704ef95b4f77a80ab3.zip" -> "builds/84b5af99a6b0bb797abe8e562d90b4c223381c57a98fd5fe5a0c05affd849dbd.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-06-30T21:47:26.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:6/invocations" -> (known after apply)
      ~ s3_key                         = "builds/6b383c1ed612793cb2cf53e1b0143090af450bacf35e050c5fab1f6abbfa45df.zip" -> "builds/fb36851ddf9ae753a5877f8722e544f0842ca2fd1ddca34729b00a6c7029d8e2.zip"
      ~ s3_object_version              = "Q5fzSFD_1ZXCaY2rawp7qYn.7Mq0jkqh" -> (known after apply)
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:168a2d7e85c8abf06f1b3970cc403377b869c8b6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "168a2d7e85c8abf06f1b3970cc403377b869c8b6"
                # (11 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "65d572034ee0f4ec5433d9ef164f1b5f-2" -> (known after apply)
      ~ id                     = "builds/6b383c1ed612793cb2cf53e1b0143090af450bacf35e050c5fab1f6abbfa45df.zip" -> (known after apply)
      ~ key                    = "builds/6b383c1ed612793cb2cf53e1b0143090af450bacf35e050c5fab1f6abbfa45df.zip" -> "builds/fb36851ddf9ae753a5877f8722e544f0842ca2fd1ddca34729b00a6c7029d8e2.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/6b383c1ed612793cb2cf53e1b0143090af450bacf35e050c5fab1f6abbfa45df.zip" -> "builds/fb36851ddf9ae753a5877f8722e544f0842ca2fd1ddca34729b00a6c7029d8e2.zip"
-       tags                   = {} -> null
      ~ version_id             = "Q5fzSFD_1ZXCaY2rawp7qYn.7Mq0jkqh" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ExtractGrantsGovDBToXML
                            cd bin/ExtractGrantsGovDBToXML
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/fb36851ddf9ae753a5877f8722e544f0842ca2fd1ddca34729b00a6c7029d8e2.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/fb36851ddf9ae753a5877f8722e544f0842ca2fd1ddca34729b00a6c7029d8e2.plan.json"
+       id                   = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4734243358249661584" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/6b383c1ed612793cb2cf53e1b0143090af450bacf35e050c5fab1f6abbfa45df.zip" -> "builds/fb36851ddf9ae753a5877f8722e544f0842ca2fd1ddca34729b00a6c7029d8e2.zip"
          ~ "timestamp" = "1688161615000353000" -> "1689207402393998000"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6120901226582440205" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/6b383c1ed612793cb2cf53e1b0143090af450bacf35e050c5fab1f6abbfa45df.zip" -> "builds/fb36851ddf9ae753a5877f8722e544f0842ca2fd1ddca34729b00a6c7029d8e2.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistFFISData"
      ~ last_modified                  = "2023-06-30T21:47:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:7/invocations" -> (known after apply)
      ~ s3_key                         = "builds/9a5a2a1390db3ffcb480b8a7cb5cadcde43d297f4090b8354371578f668cb602.zip" -> "builds/ce3c71ae942d6accd735f27e5a10d30375694651f90a34a1c2859bc19f718ff8.zip"
      ~ s3_object_version              = "XI9iN7EQaQPWfXGdIbLExyObx6wgaNaR" -> (known after apply)
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:168a2d7e85c8abf06f1b3970cc403377b869c8b6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "168a2d7e85c8abf06f1b3970cc403377b869c8b6"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "7" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "fd6df1559037be61724833b3ca7aa19a-2" -> (known after apply)
      ~ id                     = "builds/9a5a2a1390db3ffcb480b8a7cb5cadcde43d297f4090b8354371578f668cb602.zip" -> (known after apply)
      ~ key                    = "builds/9a5a2a1390db3ffcb480b8a7cb5cadcde43d297f4090b8354371578f668cb602.zip" -> "builds/ce3c71ae942d6accd735f27e5a10d30375694651f90a34a1c2859bc19f718ff8.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/9a5a2a1390db3ffcb480b8a7cb5cadcde43d297f4090b8354371578f668cb602.zip" -> "builds/ce3c71ae942d6accd735f27e5a10d30375694651f90a34a1c2859bc19f718ff8.zip"
-       tags                   = {} -> null
      ~ version_id             = "XI9iN7EQaQPWfXGdIbLExyObx6wgaNaR" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistFFISData
                            cd bin/PersistFFISData
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/ce3c71ae942d6accd735f27e5a10d30375694651f90a34a1c2859bc19f718ff8.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/ce3c71ae942d6accd735f27e5a10d30375694651f90a34a1c2859bc19f718ff8.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8262814561860869913" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9a5a2a1390db3ffcb480b8a7cb5cadcde43d297f4090b8354371578f668cb602.zip" -> "builds/ce3c71ae942d6accd735f27e5a10d30375694651f90a34a1c2859bc19f718ff8.zip"
          ~ "timestamp" = "1688161614805339000" -> "1689207402312360000"
        }
    }

  # module.PersistFFISData.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7733053324889639600" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/9a5a2a1390db3ffcb480b8a7cb5cadcde43d297f4090b8354371578f668cb602.zip" -> "builds/ce3c71ae942d6accd735f27e5a10d30375694651f90a34a1c2859bc19f718ff8.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-06-30T21:47:24.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:9/invocations" -> (known after apply)
      ~ s3_key                         = "builds/0c9a080c9198f7eddd4a4076f6698be4ae4ab63a958f67430d79f83099e12a21.zip" -> "builds/2171ac6ccd022d676f1e49500ded42f420bfa65fbec16333d909246b9b9ca815.zip"
      ~ s3_object_version              = "2O.8ut94ffxYIbidtTNHo9JW5A3KRIK6" -> (known after apply)
        tags                           = {}
      ~ version                        = "9" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:168a2d7e85c8abf06f1b3970cc403377b869c8b6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "168a2d7e85c8abf06f1b3970cc403377b869c8b6"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "9" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "54ffe07547bf85bc9dd80e7ba33b639a-2" -> (known after apply)
      ~ id                     = "builds/0c9a080c9198f7eddd4a4076f6698be4ae4ab63a958f67430d79f83099e12a21.zip" -> (known after apply)
      ~ key                    = "builds/0c9a080c9198f7eddd4a4076f6698be4ae4ab63a958f67430d79f83099e12a21.zip" -> "builds/2171ac6ccd022d676f1e49500ded42f420bfa65fbec16333d909246b9b9ca815.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/0c9a080c9198f7eddd4a4076f6698be4ae4ab63a958f67430d79f83099e12a21.zip" -> "builds/2171ac6ccd022d676f1e49500ded42f420bfa65fbec16333d909246b9b9ca815.zip"
-       tags                   = {} -> null
      ~ version_id             = "2O.8ut94ffxYIbidtTNHo9JW5A3KRIK6" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistGrantsGovXMLDB
                            cd bin/PersistGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/2171ac6ccd022d676f1e49500ded42f420bfa65fbec16333d909246b9b9ca815.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/2171ac6ccd022d676f1e49500ded42f420bfa65fbec16333d909246b9b9ca815.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3750911065083810628" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0c9a080c9198f7eddd4a4076f6698be4ae4ab63a958f67430d79f83099e12a21.zip" -> "builds/2171ac6ccd022d676f1e49500ded42f420bfa65fbec16333d909246b9b9ca815.zip"
          ~ "timestamp" = "1688161596644356000" -> "1689207383608650000"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "317247775631938488" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/0c9a080c9198f7eddd4a4076f6698be4ae4ab63a958f67430d79f83099e12a21.zip" -> "builds/2171ac6ccd022d676f1e49500ded42f420bfa65fbec16333d909246b9b9ca815.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PublishGrantEvents.module.lambda_function.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "dynamodb:ListStreams",
            ]
+           effect    = "Allow"
+           resources = [
+               "*",
            ]
+           sid       = "ListDynamoDBStreams"
        }
+       statement {
+           actions   = [
+               "sqs:SendMessage",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
+           sid       = "PublishFailuresToDLQ"
        }
+       statement {
+           actions   = [
+               "events:PutEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:events:us-west-2:357150818708:event-bus/default",
            ]
+           sid       = "PublishToEventBridge"
        }
+       statement {
+           actions   = [
+               "dynamodb:DescribeStream",
+               "dynamodb:GetRecords",
+               "dynamodb:GetShardIterator",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:dynamodb:us-west-2:357150818708:table/grantsingest-staging-prepareddata/stream/2023-05-15T13:49:25.900",
            ]
+           sid       = "StreamRecordsFromDynamoDB"
        }
    }

  # module.PublishGrantEvents.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
        }
    }

  # module.PublishGrantEvents.module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
+   resource "aws_cloudwatch_log_group" "lambda" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/lambda/grants_ingest-staging-PublishGrantEvents"
+       name_prefix       = (known after apply)
+       retention_in_days = 30
+       skip_destroy      = false
+       tags_all          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.PublishGrantEvents.module.lambda_function.aws_iam_policy.additional_inline[0] will be created
+   resource "aws_iam_policy" "additional_inline" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "grants_ingest-staging-PublishGrantEvents-inline"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags_all    = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.PublishGrantEvents.module.lambda_function.aws_iam_policy.additional_jsons[0] will be created
+   resource "aws_iam_policy" "additional_jsons" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "grants_ingest-staging-PublishGrantEvents-0"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "secretsmanager:GetSecretValue"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
+                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.PublishGrantEvents.module.lambda_function.aws_iam_policy.logs[0] will be created
+   resource "aws_iam_policy" "logs" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "grants_ingest-staging-PublishGrantEvents-logs"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags_all    = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.PublishGrantEvents.module.lambda_function.aws_iam_role.lambda[0] will be created
+   resource "aws_iam_role" "lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "grants_ingest-staging-PublishGrantEvents"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_iam_role_policy_attachment.additional_inline[0] will be created
+   resource "aws_iam_role_policy_attachment" "additional_inline" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-PublishGrantEvents"
    }

  # module.PublishGrantEvents.module.lambda_function.aws_iam_role_policy_attachment.additional_jsons[0] will be created
+   resource "aws_iam_role_policy_attachment" "additional_jsons" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-PublishGrantEvents"
    }

  # module.PublishGrantEvents.module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created
+   resource "aws_iam_role_policy_attachment" "logs" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-PublishGrantEvents"
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_event_source_mapping.this["dynamodb"] will be created
+   resource "aws_lambda_event_source_mapping" "this" {
+       bisect_batch_on_function_error     = true
+       enabled                            = true
+       event_source_arn                   = "arn:aws:dynamodb:us-west-2:357150818708:table/grantsingest-staging-prepareddata/stream/2023-05-15T13:49:25.900"
+       function_arn                       = (known after apply)
+       function_name                      = (known after apply)
+       function_response_types            = [
+           "ReportBatchItemFailures",
        ]
+       id                                 = (known after apply)
+       last_modified                      = (known after apply)
+       last_processing_result             = (known after apply)
+       maximum_batching_window_in_seconds = 180
+       maximum_record_age_in_seconds      = (known after apply)
+       maximum_retry_attempts             = 5
+       parallelization_factor             = 10
+       starting_position                  = "LATEST"
+       state                              = (known after apply)
+       state_transition_reason            = (known after apply)
+       uuid                               = (known after apply)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = [
+           "arm64",
        ]
+       arn                            = (known after apply)
+       description                    = "Publishes grant opportunity create/update events from DynamoDB to EventBridge."
+       function_name                  = "grants_ingest-staging-PublishGrantEvents"
+       handler                        = "bootstrap"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = [
+           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:41",
        ]
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = true
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "provided.al2"
+       s3_bucket                      = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       s3_key                         = "builds/90f2c761010f5585335d4eedbdbf65bc798649bac7c18483ca1b0217f3625797.zip"
+       s3_object_version              = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       skip_destroy                   = false
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       timeout                        = 30
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "DD_API_KEY_SECRET_ARN"        = (sensitive value)
+               "DD_APM_ENABLED"               = "true"
+               "DD_CAPTURE_LAMBDA_PAYLOAD"    = "true"
+               "DD_ENV"                       = "staging"
+               "DD_SERVERLESS_APPSEC_ENABLED" = "true"
+               "DD_SERVICE"                   = "grants-ingest"
+               "DD_SITE"                      = "datadoghq.com"
+               "DD_TAGS"                      = "git.commit.sha:168a2d7e85c8abf06f1b3970cc403377b869c8b6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents"
+               "DD_TRACE_ENABLED"             = "true"
+               "DD_VERSION"                   = "168a2d7e85c8abf06f1b3970cc403377b869c8b6"
+               "EVENT_BUS_NAME"               = "default"
+               "LOG_LEVEL"                    = "INFO"
+               "TZ"                           = "UTC"
            }
        }

+       ephemeral_storage {
+           size = 512
        }
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-PublishGrantEvents"
+       id                  = (known after apply)
+       principal           = "dynamodb.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = "arn:aws:dynamodb:us-west-2:357150818708:table/grantsingest-staging-prepareddata/stream/2023-05-15T13:49:25.900"
+       statement_id        = "dynamodb"
+       statement_id_prefix = (known after apply)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["dynamodb"] will be created
+   resource "aws_lambda_permission" "unqualified_alias_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-PublishGrantEvents"
+       id                  = (known after apply)
+       principal           = "dynamodb.amazonaws.com"
+       source_arn          = "arn:aws:dynamodb:us-west-2:357150818708:table/grantsingest-staging-prepareddata/stream/2023-05-15T13:49:25.900"
+       statement_id        = "dynamodb"
+       statement_id_prefix = (known after apply)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "builds/90f2c761010f5585335d4eedbdbf65bc798649bac7c18483ca1b0217f3625797.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "builds/90f2c761010f5585335d4eedbdbf65bc798649bac7c18483ca1b0217f3625797.zip"
+       storage_class          = "ONEZONE_IA"
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.PublishGrantEvents.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PublishGrantEvents
                            cd bin/PublishGrantEvents
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/90f2c761010f5585335d4eedbdbf65bc798649bac7c18483ca1b0217f3625797.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/90f2c761010f5585335d4eedbdbf65bc798649bac7c18483ca1b0217f3625797.plan.json"
+       id                   = (known after apply)
    }

  # module.PublishGrantEvents.module.lambda_function.null_resource.archive[0] will be created
+   resource "null_resource" "archive" {
+       id       = (known after apply)
+       triggers = {
+           "filename"  = "builds/90f2c761010f5585335d4eedbdbf65bc798649bac7c18483ca1b0217f3625797.zip"
+           "timestamp" = "1689207385666683000"
        }
    }

  # module.PublishGrantEvents.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be created
+   resource "null_resource" "sam_metadata_aws_lambda_function" {
+       id       = (known after apply)
+       triggers = {
+           "built_output_path"    = "builds/90f2c761010f5585335d4eedbdbf65bc798649bac7c18483ca1b0217f3625797.zip"
+           "original_source_code" = jsonencode(
                [
+                   {
+                       commands = [
+                           "task build-PublishGrantEvents",
+                           "cd bin/PublishGrantEvents",
+                           ":zip",
                        ]
+                       path     = "./.."
                    },
                ]
            )
+           "resource_name"        = "aws_lambda_function.this[0]"
+           "resource_type"        = "ZIP_LAMBDA_FUNCTION"
+           "source_code_property" = "path"
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-06-30T21:47:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:8/invocations" -> (known after apply)
      ~ s3_key                         = "builds/aff63d37b4f0cbe67d246555a2edf691a1ff00b9e1b07ef2624fdf3623068c66.zip" -> "builds/d7accd95ed1b99c386596ae08f8c767f62a7cb2eb03d2de3987501d9e2908fce.zip"
      ~ s3_object_version              = "1l1Dx4a92qmy19ewDqCdlh1Pl2dsfvun" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:168a2d7e85c8abf06f1b3970cc403377b869c8b6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "168a2d7e85c8abf06f1b3970cc403377b869c8b6"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "8" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0181913ba32855d2d7a81745305be4e4-2" -> (known after apply)
      ~ id                     = "builds/aff63d37b4f0cbe67d246555a2edf691a1ff00b9e1b07ef2624fdf3623068c66.zip" -> (known after apply)
      ~ key                    = "builds/aff63d37b4f0cbe67d246555a2edf691a1ff00b9e1b07ef2624fdf3623068c66.zip" -> "builds/d7accd95ed1b99c386596ae08f8c767f62a7cb2eb03d2de3987501d9e2908fce.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/aff63d37b4f0cbe67d246555a2edf691a1ff00b9e1b07ef2624fdf3623068c66.zip" -> "builds/d7accd95ed1b99c386596ae08f8c767f62a7cb2eb03d2de3987501d9e2908fce.zip"
-       tags                   = {} -> null
      ~ version_id             = "1l1Dx4a92qmy19ewDqCdlh1Pl2dsfvun" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitFFISSpreadsheet
                            cd bin/SplitFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/d7accd95ed1b99c386596ae08f8c767f62a7cb2eb03d2de3987501d9e2908fce.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/d7accd95ed1b99c386596ae08f8c767f62a7cb2eb03d2de3987501d9e2908fce.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3505989702210606467" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/aff63d37b4f0cbe67d246555a2edf691a1ff00b9e1b07ef2624fdf3623068c66.zip" -> "builds/d7accd95ed1b99c386596ae08f8c767f62a7cb2eb03d2de3987501d9e2908fce.zip"
          ~ "timestamp" = "1688161614709523000" -> "1689207402672769000"
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3564569430013289707" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/aff63d37b4f0cbe67d246555a2edf691a1ff00b9e1b07ef2624fdf3623068c66.zip" -> "builds/d7accd95ed1b99c386596ae08f8c767f62a7cb2eb03d2de3987501d9e2908fce.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-06-30T21:47:23.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:36" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:36/invocations" -> (known after apply)
      ~ s3_key                         = "builds/3d8dc7f36f59fa305ea9101035b91b5b196d34573b1de24ee6f1e40fa16ce696.zip" -> "builds/ea91cc37590235e3a0f77ac6c59a0d7ac63be1f1e43584e73c03846e07954a47.zip"
      ~ s3_object_version              = "26n5E_3ZABjcvlUFrsGZSQZ1gDf5AQ5X" -> (known after apply)
        tags                           = {}
      ~ version                        = "36" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:168a2d7e85c8abf06f1b3970cc403377b869c8b6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "168a2d7e85c8abf06f1b3970cc403377b869c8b6"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "36" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e58d8357699231f8838af5cac611dbee-2" -> (known after apply)
      ~ id                     = "builds/3d8dc7f36f59fa305ea9101035b91b5b196d34573b1de24ee6f1e40fa16ce696.zip" -> (known after apply)
      ~ key                    = "builds/3d8dc7f36f59fa305ea9101035b91b5b196d34573b1de24ee6f1e40fa16ce696.zip" -> "builds/ea91cc37590235e3a0f77ac6c59a0d7ac63be1f1e43584e73c03846e07954a47.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/3d8dc7f36f59fa305ea9101035b91b5b196d34573b1de24ee6f1e40fa16ce696.zip" -> "builds/ea91cc37590235e3a0f77ac6c59a0d7ac63be1f1e43584e73c03846e07954a47.zip"
-       tags                   = {} -> null
      ~ version_id             = "26n5E_3ZABjcvlUFrsGZSQZ1gDf5AQ5X" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/ea91cc37590235e3a0f77ac6c59a0d7ac63be1f1e43584e73c03846e07954a47.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/ea91cc37590235e3a0f77ac6c59a0d7ac63be1f1e43584e73c03846e07954a47.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1756512890612805212" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3d8dc7f36f59fa305ea9101035b91b5b196d34573b1de24ee6f1e40fa16ce696.zip" -> "builds/ea91cc37590235e3a0f77ac6c59a0d7ac63be1f1e43584e73c03846e07954a47.zip"
          ~ "timestamp" = "1688161596966590000" -> "1689207384258514800"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1791331425328214692" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/3d8dc7f36f59fa305ea9101035b91b5b196d34573b1de24ee6f1e40fa16ce696.zip" -> "builds/ea91cc37590235e3a0f77ac6c59a0d7ac63be1f1e43584e73c03846e07954a47.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 63 to add, 13 to change, 32 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/5537667870)*